src/Enums/ТипыМобильныхУстройств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>ТипыМобильныхУстройств</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Планшет</Name>
					<Comment>&gt; 9"</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Плафон</Name>
					<Comment>5" - 9''</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Смартфон</Name>
					<Comment>&lt; 4.9"</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/CommonModules/ОбщегоНазначения/Ext/Module.bsl
#Область Параметры_Сеанса

// Устанавливает тип мобильного устройства.
//
Процедура УстановитьТипМобильногоУстройства() Экспорт
	
	ТипМобильногоУстройства = Перечисления.ТипыМобильныхУстройств.Планшет;
	
	#Если МобильноеПриложениеСервер Тогда
		ИнформацияЭкрана = ПолучитьИнформациюЭкрановКлиента();
		DPI		= ИнформацияЭкрана[0].DPI;
		Высота	= ИнформацияЭкрана[0].Высота;
		Ширина	= ИнформацияЭкрана[0].Ширина;
		РазмерЭкрана = Sqrt((Высота/DPI*Высота/DPI)+(Ширина/DPI*Ширина/DPI));
		// Порог планшета зависит от DPI
		// Samasung Galaxy Tab S2 DPI = 320, РазмерЭкрана = 7.85
		// iPAD DPI = 264, РазмерЭкрана = 9.7
		// iPAD 4 mini DPI = 326, РазмерЭкрана = 7.8
		Если DPI > 310 Тогда
			ПорогПланшета = 7.85;
		Иначе
			ПорогПланшета = 9;
		КонецЕсли;
		ПорогПлафона = 4.9;
		Если РазмерЭкрана < ПорогПланшета Тогда
			Если РазмерЭкрана < ПорогПлафона Тогда
				ТипМобильногоУстройства = Перечисления.ТипыМобильныхУстройств.Смартфон;
			Иначе
				ТипМобильногоУстройства = Перечисления.ТипыМобильныхУстройств.Плафон;
			КонецЕсли;
		КонецЕсли;
	#КонецЕсли
	
	ТекущийТипМобильногоУстройства = Константы.ТипМобильногоУстройства.Получить();
	Если НЕ ТекущийТипМобильногоУстройства = ТипМобильногоУстройства Тогда
		Константы.ТипМобильногоУстройства.Установить(ТипМобильногоУстройства);
	КонецЕсли;
	
КонецПроцедуры // УстановитьТипМобильногоУстройства

#КонецОбласти
